espressif/arduino-esp32/libraries/BLE/src/BLECharacteristic.cpp
  switch (event) {
      // Events handled:
      //
      // ESP_GATTS_ADD_CHAR_EVT
      // ESP_GATTS_CONF_EVT
      // ESP_GATTS_CONNECT_EVT
      // ESP_GATTS_DISCONNECT_EVT
      // ESP_GATTS_EXEC_WRITE_EVT
      // ESP_GATTS_READ_EVT
      // ESP_GATTS_WRITE_EVT

    //
    // ESP_GATTS_EXEC_WRITE_EVT
    // When we receive this event it is an indication that a previous write long needs to be committed.
    //
    // exec_write:
    // - uint16_t conn_id
    // - uint32_t trans_id
    // - esp_bd_addr_t bda
    // - uint8_t exec_write_flag - Either ESP_GATT_PREP_WRITE_EXEC or ESP_GATT_PREP_WRITE_CANCEL
    //
    case ESP_GATTS_EXEC_WRITE_EVT:
      {
        if (m_writeEvt) {
          m_writeEvt = false;
          if (param->exec_write.exec_write_flag == ESP_GATT_PREP_WRITE_EXEC) {
            m_value.commit();
            // Invoke the onWrite callback handler.
            m_pCallbacks->onWrite(this, param);
          } else {
            m_value.cancel();
          }
          // ???
          esp_err_t errRc = ::esp_ble_gatts_send_response(
            gatts_if,
            param->write.conn_id,
            param->write.trans_id, ESP_GATT_OK, nullptr);
          if (errRc != ESP_OK) {
            log_e("esp_ble_gatts_send_response: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
          }
        }
        break;
      }  // ESP_GATTS_EXEC_WRITE_EVT


    // ESP_GATTS_ADD_CHAR_EVT - Indicate that a characteristic was added to the service.
    // add_char:
    // - esp_gatt_status_t status
    // - uint16_t attr_handle
    // - uint16_t service_handle
    // - esp_bt_uuid_t char_uuid
    case ESP_GATTS_ADD_CHAR_EVT:
      {
        if (getHandle() == param->add_char.attr_handle) {
          // we have created characteristic, now we can create descriptors
          // BLEDescriptor* pDescriptor = m_descriptorMap.getFirst();
          // while (pDescriptor != nullptr) {
          // 	pDescriptor->executeCreate(this);
          // 	pDescriptor = m_descriptorMap.getNext();
          // } // End while
          m_semaphoreCreateEvt.give();
        }
        break;
      }  // ESP_GATTS_ADD_CHAR_EVT


    // ESP_GATTS_WRITE_EVT - A request to write the value of a characteristic has arrived.
    //
    // write:
    // - uint16_t      conn_id
    // - uint16_t      trans_id
    // - esp_bd_addr_t bda
    // - uint16_t      handle
    // - uint16_t      offset
    // - bool          need_rsp
    // - bool          is_prep
    // - uint16_t      len
    // - uint8_t      *value
    //
    case ESP_GATTS_WRITE_EVT:
      {
        // We check if this write request is for us by comparing the handles in the event.  If it is for us
        // we save the new value.  Next we look at the need_rsp flag which indicates whether or not we need
        // to send a response.  If we do, then we formulate a response and send it.
        if (param->write.handle == m_handle) {
          if (param->write.is_prep) {
            m_value.addPart(param->write.value, param->write.len);
            m_writeEvt = true;
          } else {
            setValue(param->write.value, param->write.len);
          }

          log_d(" - Response to write event: New value: handle: %.2x, uuid: %s",
                getHandle(), getUUID().toString().c_str());

          char* pHexData = BLEUtils::buildHexData(nullptr, param->write.value, param->write.len);
          log_d(" - Data: length: %d, data: %s", param->write.len, pHexData);
          free(pHexData);

          if (param->write.need_rsp) {
            esp_gatt_rsp_t rsp;

            rsp.attr_value.len = param->write.len;
            rsp.attr_value.handle = m_handle;
            rsp.attr_value.offset = param->write.offset;
            rsp.attr_value.auth_req = ESP_GATT_AUTH_REQ_NONE;
            memcpy(rsp.attr_value.value, param->write.value, param->write.len);

            esp_err_t errRc = ::esp_ble_gatts_send_response(
              gatts_if,
              param->write.conn_id,
              param->write.trans_id, ESP_GATT_OK, &rsp);
            if (errRc != ESP_OK) {
              log_e("esp_ble_gatts_send_response: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
            }
          }  // Response needed

          if (param->write.is_prep != true) {
            // Invoke the onWrite callback handler.
            m_pCallbacks->onWrite(this, param);
          }
        }  // Match on handles.
        break;
      }  // ESP_GATTS_WRITE_EVT


    // ESP_GATTS_READ_EVT - A request to read the value of a characteristic has arrived.
    //
    // read:
    // - uint16_t      conn_id
    // - uint32_t      trans_id
    // - esp_bd_addr_t bda
    // - uint16_t      handle
    // - uint16_t      offset
    // - bool          is_long
    // - bool          need_rsp
    //
    case ESP_GATTS_READ_EVT:
      {
        if (param->read.handle == m_handle) {



          // Here's an interesting thing.  The read request has the option of saying whether we need a response
          // or not.  What would it "mean" to receive a read request and NOT send a response back?  That feels like
          // a very strange read.
          //
          // We have to handle the case where the data we wish to send back to the client is greater than the maximum
          // packet size of 22 bytes.  In this case, we become responsible for chunking the data into units of 22 bytes.
          // The apparent algorithm is as follows:
          //
          // If the is_long flag is set then this is a follow on from an original read and we will already have sent at least 22 bytes.
          // If the is_long flag is not set then we need to check how much data we are going to send.  If we are sending LESS than
          // 22 bytes, then we "just" send it and that's the end of the story.
          // If we are sending 22 bytes exactly, we just send it BUT we will get a follow on request.
          // If we are sending more than 22 bytes, we send the first 22 bytes and we will get a follow on request.
          // Because of follow on request processing, we need to maintain an offset of how much data we have already sent
          // so that when a follow on request arrives, we know where to start in the data to send the next sequence.
          // Note that the indication that the client will send a follow on request is that we sent exactly 22 bytes as a response.
          // If our payload is divisible by 22 then the last response will be a response of 0 bytes in length.
          //
          // The following code has deliberately not been factored to make it fewer statements because this would cloud the
          // the logic flow comprehension.
          //

          // get mtu for peer device that we are sending read request to
          uint16_t maxOffset = getService()->getServer()->getPeerMTU(param->read.conn_id) - 1;
          log_d("mtu value: %d", maxOffset);
          if (param->read.need_rsp) {
            log_d("Sending a response (esp_ble_gatts_send_response)");
            esp_gatt_rsp_t rsp;

