espressif/arduino-esp32/libraries/BLE/src/BLECharacteristic.cpp
void BLECharacteristic::setValue(uint32_t& data32) {
  uint8_t temp[4];
  temp[0] = data32;
  temp[1] = data32 >> 8;
  temp[2] = data32 >> 16;
  temp[3] = data32 >> 24;
  setValue(temp, 4);
}  // setValue

void BLECharacteristic::setValue(int& data32) {
  uint8_t temp[4];
  temp[0] = data32;
  temp[1] = data32 >> 8;
  temp[2] = data32 >> 16;
  temp[3] = data32 >> 24;
  setValue(temp, 4);
}  // setValue

void BLECharacteristic::setValue(float& data32) {
  float temp = data32;
  setValue((uint8_t*)&temp, 4);
}  // setValue

void BLECharacteristic::setValue(double& data64) {
  double temp = data64;
  setValue((uint8_t*)&temp, 8);
}  // setValue


/**
 * @brief Set the Write No Response property value.
 * @param [in] value Set to true if we are to allow writes with no response.
 */
void BLECharacteristic::setWriteNoResponseProperty(bool value) {
  //log_d("setWriteNoResponseProperty(%d)", value);
  if (value) {
    m_properties = (esp_gatt_char_prop_t)(m_properties | ESP_GATT_CHAR_PROP_BIT_WRITE_NR);
  } else {
    m_properties = (esp_gatt_char_prop_t)(m_properties & ~ESP_GATT_CHAR_PROP_BIT_WRITE_NR);
  }
}  // setWriteNoResponseProperty


/**
 * @brief Set the Write property value.
 * @param [in] value Set to true if we are to allow writes.
 */
void BLECharacteristic::setWriteProperty(bool value) {
  //log_d("setWriteProperty(%d)", value);
  if (value) {
    m_properties = (esp_gatt_char_prop_t)(m_properties | ESP_GATT_CHAR_PROP_BIT_WRITE);
  } else {
    m_properties = (esp_gatt_char_prop_t)(m_properties & ~ESP_GATT_CHAR_PROP_BIT_WRITE);
  }
}  // setWriteProperty


/**
 * @brief Return a string representation of the characteristic.
 * @return A string representation of the characteristic.
 */
String BLECharacteristic::toString() {
  String res = "UUID: " + m_bleUUID.toString() + ", handle : 0x";
  char hex[5];
  snprintf(hex, sizeof(hex), "%04x", m_handle);
  res += hex;
  res += " ";
  if (m_properties & ESP_GATT_CHAR_PROP_BIT_READ) res += "Read ";
  if (m_properties & ESP_GATT_CHAR_PROP_BIT_WRITE) res += "Write ";
  if (m_properties & ESP_GATT_CHAR_PROP_BIT_WRITE_NR) res += "WriteNoResponse ";
  if (m_properties & ESP_GATT_CHAR_PROP_BIT_BROADCAST) res += "Broadcast ";
  if (m_properties & ESP_GATT_CHAR_PROP_BIT_NOTIFY) res += "Notify ";
  if (m_properties & ESP_GATT_CHAR_PROP_BIT_INDICATE) res += "Indicate ";
  return res;
}  // toString


BLECharacteristicCallbacks::~BLECharacteristicCallbacks() {}

void BLECharacteristicCallbacks::onRead(BLECharacteristic* pCharacteristic, esp_ble_gatts_cb_param_t* param) {
  onRead(pCharacteristic);
}  // onRead

void BLECharacteristicCallbacks::onRead(BLECharacteristic* pCharacteristic) {
  log_d(">> onRead: default");
  log_d("<< onRead");
}  // onRead


void BLECharacteristicCallbacks::onWrite(BLECharacteristic* pCharacteristic, esp_ble_gatts_cb_param_t* param) {
  onWrite(pCharacteristic);
}  // onWrite

void BLECharacteristicCallbacks::onWrite(BLECharacteristic* pCharacteristic) {
  log_d(">> onWrite: default");
  log_d("<< onWrite");
}  // onWrite


void BLECharacteristicCallbacks::onNotify(BLECharacteristic* pCharacteristic) {
  log_d(">> onNotify: default");
  log_d("<< onNotify");
}  // onNotify


void BLECharacteristicCallbacks::onStatus(BLECharacteristic* pCharacteristic, Status s, uint32_t code) {
  log_d(">> onStatus: default");
  log_d("<< onStatus");
}  // onStatus


#endif /* CONFIG_BLUEDROID_ENABLED */
#endif /* SOC_BLE_SUPPORTED */
